Autodesk.Revit.DB.Architecture.GutterTypeSet
A set that contains gutter types.

Autodesk.Revit.DB.Architecture.GutterTypeSet.Insert(Autodesk.Revit.DB.Architecture.GutterType)
System.Int32
Insert the specified gutter type into the set.
item: The gutter type to be inserted into the set.
Returns: Returns whether the gutter type was inserted into the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.ReverseIterator
Autodesk.Revit.DB.Architecture.GutterTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.ForwardIterator
Autodesk.Revit.DB.Architecture.GutterTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.Erase(Autodesk.Revit.DB.Architecture.GutterType)
System.Int32
Removes a specified gutter type from the set.
item: The gutter type to be erased.
Returns: The number of gutter types that were erased from the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.Contains(Autodesk.Revit.DB.Architecture.GutterType)
System.Boolean
Tests for the existence of a gutter type within the set.
item: The gutter type to be searched for.
Returns: The Contains method returns True if the gutter type is within the set, otherwise False.

Autodesk.Revit.DB.Architecture.GutterTypeSet.Clear
void
Removes every gutter type from the set, rendering it empty.

Autodesk.Revit.DB.Architecture.GutterTypeSet.Size
System.Int32
get
Returns the number of gutter types that are in the set.

Autodesk.Revit.DB.Architecture.GutterTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.